app/controllers/microposts_controller.rb

      def create

      secure_post = params.require(:micropost).permit(:content)
        @micropost = current_user.microposts.build(secure_post)
        if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "123"], ["user_id", 11], ["created_at", 2016-11-15 10:10:21 UTC], ["updated_at", 2016-11-15 10:10:21 UTC]]