app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
       def create
        secure_params = params.require(:user).permit(:name, :email,
                                  :password, :password_confirmation)
        @user = User.new(secure_params)
        if @user.save